vanBassum/DPS50xx/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash size and speed
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# HTTP server WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y

# OTA rollback support
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Increase timer task stack (default 2048 too small for WiFi calls in timer callbacks)
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# FAT long filename support (needed for web UI files)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
